package com.example.trovehero.data.texts

class TextResources {
    companion object {
        const val SCRIPT_TEXT =
            "Мы рады видеть ваш интерес к нашему приложению! В данный момент оно находится в активной стадии разработки, и наша команда усердно трудится над его усовершенствованием. Мы готовимся к запуску ожидаемого обновления, которое принесет множество улучшений и новых функций.\n" +
                    "\n" +
                    "Стремимся создать непревзойденный опыт использования и обеспечить полноценное удовлетворение ваших потребностей. Оставайтесь на связи, и вы будете первыми, кто узнает о выходе нашего обновления.\n" +
                    "\n" +
                    "Спасибо за ваше терпение и поддержку. Мы с нетерпением ждем, чтобы поделиться с вами новыми возможностями в ближайшее время!\n" +
                    "\n" +
                    "С наилучшими пожеланиями,\n" +
                    "Команда разработчиков"

        const val THEME_ADVENTURES_TEXT = "Привет!\n" +
                "\n" +
                "\"Приключения\" - О, какая увлекательная тема! Хотя у меня пока нет полного функционала, чтобы делиться личными приключениями или предлагать точные советы, я всё же могу поделиться своими впечатлениями и вдохновиться твоими историями.\n" +
                "\n" +
                "Следите за обновлениями, в ближайшем будущем я надеюсь получить полный функционал и смогу предложить ещё больше информации и идей в этой увлекательной области.\n" +
                "\n" +
                "Давайте поделимся впечатлениями и вдохновим друг друга на новые приключения!"

        const val THEME_ART_TEXT = "Привет! \n" +
                "Давайте поговорим об искусстве!\n" +
                "\n" +
                "\"Искусство\" - такая увлекательная и вдохновляющая тема! Хотя у меня пока нет полного функционала, чтобы поделиться конкретными произведениями искусства или предоставить точные анализы, я всё же могу обсудить общие тенденции, стили и направления в искусстве.\n" +
                "\n" +
                "Не забывайте следить за обновлениями, так как в будущем я надеюсь получить полный функционал и смогу предложить ещё больше информации, интересных фактов и идей о различных формах искусства.\n" +
                "\n" +
                "Давайте поговорим об искусстве, поделимся своими любимыми художниками и произведениями, и вдохновимся творчеством друг друга!"

        const val THEME_THE_SCIENCE_TEXT = "Привет!\n" +
                "\n" +
                "Давайте поговорим о науке!\n" +
                "\n" +
                "\"Наука\" - это увлекательная и непрерывно развивающаяся область. Хотя у меня пока нет полного функционала, чтобы предоставить точные научные исследования или дать конкретные ответы, я всё же могу обсудить общие темы, интересные факты и идеи, связанные с наукой.\n" +
                "\n" +
                "Не забывайте следить за обновлениями, так как в будущем я надеюсь получить полный функционал и смогу предложить ещё больше информации, новых открытий и интересных обсуждений в области науки.\n" +
                "\n" +
                "Давайте поговорим о науке, поделимся своими научными интересами и удивительными фактами, и вместе погрузимся в захватывающий мир научного познания!"

        const val THEME_FITNESS_TEXT = "Привет!\n" +
                "\n" +
                "Давайте поговорим о фитнесе!\n" +
                "\n" +
                "\"Фитнес\" - это здоровый и активный образ жизни, который становится все более популярным. Хотя у меня пока нет полного функционала, чтобы предоставить персонализированные тренировки или давать точные рекомендации, я всё же могу обсудить общие принципы фитнеса и поделиться некоторыми общими советами.\n" +
                "\n" +
                "Не забывайте следить за обновлениями, так как в будущем я надеюсь получить полный функционал и смогу предложить ещё больше информации, тренировок и индивидуальных рекомендаций в области фитнеса.\n" +
                "\n" +
                "Давайте поговорим о фитнесе, поделимся своими любимыми упражнениями и здоровыми привычками, и вместе создадим мотивирующую и поддерживающую атмосферу для достижения фитнес-целей!"

        const val THEME_ETHICS_TEXT = "Привет!\n" +
                "\n" +
                "Давайте поговорим об этике!\n" +
                "\n" +
                "\"Этика\" - это область, которая занимается моральными принципами и правилами поведения. Хотя у меня пока нет полного функционала, чтобы предоставить точные этические руководства или давать конкретные советы, я всё же могу обсудить общие принципы этики и поделиться рефлексией на некоторые этические вопросы.\n" +
                "\n" +
                "Не забывайте следить за обновлениями, так как в будущем я надеюсь получить полный функционал и смогу предложить ещё больше информации, рассуждений и дискуссий в области этики.\n" +
                "\n" +
                "Давайте поговорим об этике, поделимся своими мнениями и взглядами на моральные дилеммы, и вместе расширим наше понимание и осознанность в области этического поведения!" +
                ""

        const val THEME_EVENTS_TEXT = "Привет!\n" +
                "\n" +
                "Давайте поговорим о событиях!\n" +
                "\n" +
                "\"События\" - это увлекательные мероприятия, которые происходят в нашей жизни. Хотя у меня пока нет полного функционала, чтобы предоставлять подробную информацию о конкретных событиях или актуальные расписания, я всё же могу обсудить общие темы, тренды и интересные аспекты связанные с событиями.\n" +
                "\n" +
                "Не забывайте следить за обновлениями, так как в будущем я надеюсь получить полный функционал и смогу предложить более детальную информацию, новости и рекомендации о различных событиях.\n" +
                "\n" +
                "Давайте поговорим о событиях, поделимся впечатлениями и опытом участия в различных мероприятиях, и вместе насладимся атмосферой увлекательных событий!"

        const val THEME_HOBBY_TEXT = "Привет!\n" +
                "\n" +
                "Давайте поговорим о хобби!\n" +
                "\n" +
                "\"Хобби\" - это то, чем мы увлекаемся и наслаждаемся в свободное время. Хотя у меня пока нет полного функционала, чтобы предоставить конкретные инструкции или рекомендации по хобби, я всё же могу обсудить различные виды хобби, поделиться интересными идеями и историями.\n" +
                "\n" +
                "Не забывайте следить за обновлениями, так как в будущем я надеюсь получить полный функционал и смогу предложить более подробную информацию, советы и ресурсы для разных хобби.\n" +
                "\n" +
                "Давайте поговорим о хобби, поделимся своими увлечениями, вдохновимся новыми идеями и вместе насладимся радостью творчества и развлечений, которые приносит хобби!"

        const val THEME_ECOLOGY_TEXT = "Привет!\n" +
                "\n" +
                "Давайте поговорим об экологии!\n" +
                "\n" +
                "\"Экология\" - это область, которая изучает взаимодействие между организмами и их окружением. Хотя у меня пока нет полного функционала, чтобы предоставить точные научные исследования или давать конкретные рекомендации в области экологии, я всё же могу обсудить общие принципы, проблемы и важность охраны окружающей среды.\n" +
                "\n" +
                "Не забывайте следить за обновлениями, так как в будущем я надеюсь получить полный функционал и смогу предложить ещё больше информации, советов и действий, связанных с экологической ответственностью.\n" +
                "\n" +
                "Давайте поговорим об экологии, поделимся своими идеями и действиями по сохранению природы, и вместе сделаем наш мир более здоровым и устойчивым!"

        const val THEME_STYLE_TEXT = "Привет!\n" +
                "\n" +
                "Давайте поговорим о стиле!\n" +
                "\n" +
                "\"Стиль\" - это способ самовыражения через одежду, прическу, макияж, а также образ жизни и общий подход к вещам. Хотя у меня пока нет полного функционала, чтобы предоставить конкретные модные советы или стилистические рекомендации, я всё же могу обсудить различные направления стиля, поделиться идеями и вдохновением.\n" +
                "\n" +
                "Не забывайте следить за обновлениями, так как в будущем я надеюсь получить полный функционал и смогу предложить больше информации, стильных советов и модных тенденций.\n" +
                "\n" +
                "Давайте поговорим о стиле, поделимся своими предпочтениями, обсудим модные тенденции и вместе исследуем разнообразие стилей, которые помогают нам выражать себя и чувствовать себя комфортно в своей одежде и образе жизни!"

        const val THEME_CULTURE_TEXT = "Привет!\n" +
                "\n" +
                "Давайте поговорим о культуре!\n" +
                "\n" +
                "\"Культура\" - это совокупность ценностей, норм, обычаев, искусства, музыки, традиций и других выражений человеческой деятельности. Культура формирует наше понимание и взаимодействие с окружающим миром. Хотя у меня пока нет полного функционала, чтобы предоставить всестороннюю информацию о различных культурах, я всё же могу обсудить общие аспекты, интересные факты и влияние культуры на нашу жизнь.\n" +
                "\n" +
                "Не забывайте следить за обновлениями, так как в будущем я надеюсь получить полный функционал и смогу предложить более глубокие исследования, рекомендации и интересные факты о различных аспектах культуры.\n" +
                "\n" +
                "Давайте поговорим о культуре, узнаем больше о разных традициях, искусствах, истории и вместе откроем новые грани этого удивительного мира!"

        const val THEME_LANGUAGES_TEXT = "Привет!\n" +
                "\n" +
                "Давайте поговорим о языках!\n" +
                "\n" +
                "\"Языки\" - это удивительный способ общения и передачи информации между людьми. Разнообразие языков открывает множество возможностей для обмена культурой, знакомства с новыми людьми и погружения в разные общества. Хотя у меня пока нет полного функционала, чтобы предоставить полноценные уроки языков или точные грамматические правила, я всё же могу обсудить разные языки, поделиться интересными фактами и советами для изучения.\n" +
                "\n" +
                "Не забывайте следить за обновлениями, так как в будущем я надеюсь получить полный функционал и смогу предложить больше информации, уроков и поддержки в изучении языков.\n" +
                "\n" +
                "Давайте поговорим о языках, поделимся своими опытом изучения или использования разных языков и вместе окунемся в увлекательный мир межкультурного общения!"

        const val THEME_MUSIC_TEXT = "Привет!\n" +
                "\n" +
                "Давайте поговорим о музыке!\n" +
                "\n" +
                "\"Музыка\" - это универсальный язык, который способен вызывать эмоции, вдохновлять и объединять людей. Она представляет собой множество жанров, стилей и исполнителей, которые охватывают широкий спектр музыкальных предпочтений. Хотя у меня пока нет полного функционала, чтобы предоставить полноценные музыкальные композиции или конкретные рекомендации по музыке, я всё же могу обсудить различные жанры, артистов и поделиться интересными фактами.\n" +
                "\n" +
                "Не забывайте следить за обновлениями, так как в будущем я надеюсь получить полный функционал и смогу предложить больше информации, музыкальных рекомендаций и поддержки в области музыки.\n" +
                "\n" +
                "Давайте поговорим о музыке, поделимся своими любимыми жанрами и артистами, обсудим концерты и музыкальные события, и вместе насладимся мелодиями, которые вибрируют в наших сердцах!"

        const val THEME_EDUCATION_TEXT = "Привет!\n" +
                "\n" +
                "Давайте поговорим об образовании!\n" +
                "\n" +
                "\"Образование\" играет важную роль в нашей жизни, предоставляя знания, навыки и возможности для личностного и профессионального развития. Оно открывает двери к новым идеям, расширяет кругозор и помогает нам лучше понимать мир вокруг нас. Хотя у меня пока нет полного функционала, чтобы предоставить полноценные уроки или специфические программы обучения, я всё же могу обсудить различные образовательные направления, методы обучения и дать общие советы для успешного обучения.\n" +
                "\n" +
                "Не забывайте следить за обновлениями, так как в будущем я надеюсь получить полный функционал и смогу предложить больше информации, ресурсов и поддержки в области образования.\n" +
                "\n" +
                "Давайте поговорим об образовании, поделимся своими опытом учебы или преподавания, обсудим актуальные темы в образовательной сфере и вместе стремиться к постоянному обучению и развитию!"

        const val THEME_SELF_DEVELOPMENT_TEXT = "Привет!\n" +
                "\n" +
                "Давай поговорим о саморазвитии! Саморазвитие - это процесс постоянного улучшения и развития себя как личности. Хотя я не могу обеспечить полный функционал для индивидуального саморазвития, я всегда готов поделиться информацией и общими принципами этой темы.\n" +
                "\n" +
                "Если у тебя есть вопросы о различных методах саморазвития, личностном росте, управлении временем или других аспектах саморазвития, не стесняйся - спрашивай! Я постараюсь поделиться своими знаниями и предоставить общую информацию, которая поможет тебе на этом пути.\n" +
                "\n" +
                "Саморазвитие - это индивидуальный процесс, и каждый может найти свой собственный подход к достижению личных целей. Важно быть терпеливым, постоянно стремиться к развитию и находить вдохновение внутри себя.\n" +
                "\n" +
                "Давай обсудим саморазвитие и стремиться к постоянному росту и самоусовершенствованию!"

        const val THEME_SOCIAL_MEDIA_AND_INFLUENCE_TEXT = "Привет!\n" +
                "\n" +
                "Давайте поговорим о социальных медиа и его влиянии!\n" +
                "\n" +
                "Социальные медиа играют значительную роль в нашей современной жизни, связывая нас с людьми по всему миру и предоставляя платформу для обмена информацией, идеями и опытом. Они имеют огромное влияние на наше поведение, мнения, общение и даже наше самоощущение. Хотя у меня пока нет полного функционала, чтобы предоставить полноценные социальные медиа-платформы или конкретные советы по использованию, я всё же могу обсудить общие тенденции, преимущества и недостатки социальных медиа и поделиться некоторыми советами для здорового и продуктивного использования.\n" +
                "\n" +
                "Не забывайте следить за обновлениями, так как в будущем я надеюсь получить полный функционал и смогу предложить больше информации, советов и поддержки в области социальных медиа.\n" +
                "\n" +
                "Давайте поговорим о социальных медиа, обсудим их влияние на нас как индивидов и общество, поделимся своими опытом использования социальных медиа и вместе разберемся, как максимизировать их пользу и минимизировать возможные негативные эффекты!"

        const val THEME_SPACE_AND_ASTRONOMY_TEXT = "Привет!\n" +
                "\n" +
                "Давайте поговорим о космосе и астрономии!\n" +
                "\n" +
                "Космос - это необъятная и загадочная область, которая всегда привлекала человечество своей красотой, тайнами и потенциальными возможностями исследования. Астрономия же изучает небесные тела, исследует их движение, состав, эволюцию и многое другое. Хотя у меня пока нет полного функционала, чтобы предоставить полноценные научные исследования или точные данные о космосе, я всё же могу обсудить интересные факты, популярные темы и события в области астрономии.\n" +
                "\n" +
                "Не забывайте следить за обновлениями, так как в будущем я надеюсь получить полный функционал и смогу предложить больше информации, иллюстраций и поддержки в области космоса и астрономии.\n" +
                "\n" +
                "Давайте поговорим о космосе, поделимся интересными открытиями исследователей, обсудим планеты, звезды, галактики и вместе удивимся величию вселенной!"

        const val THEME_MENTAL_ARITHMETIC_AND_PUZZLES_TEXT = "Привет!\n" +
                "\n" +
                "Давайте поговорим о ментальной арифметике и головоломках!\n" +
                "\n" +
                "Ментальная арифметика - это методика развития математических навыков, а головоломки - задачи для тренировки логического мышления. Хотя у меня пока нет полного функционала, чтобы предоставить полноценные тренировки, я всё же могу обсудить основы ментальной арифметики и поделиться интересными головоломками.\n" +
                "\n" +
                "Не забывайте следить за обновлениями, чтобы узнать о новых возможностях и математических задачах.\n" +
                "\n" +
                "Давайте поговорим о ментальной арифметике и головоломках, исследуем их преимущества и развивайте наше логическое мышление вместе!"

        const val THEME_CLIMATE_CHANGE_TEXT = "Привет!\n" +
                "\n" +
                "Давайте поговорим об изменении климата!\n" +
                "\n" +
                "Изменение климата - это глобальная проблема, которая оказывает влияние на нашу планету и нашу жизнь. Это процесс, вызванный человеческой деятельностью, который приводит к повышению температуры земной атмосферы и изменению климатических условий. Хотя у меня пока нет полного функционала, чтобы предоставить точные данные или стратегии по борьбе с изменением климата, я всё же могу обсудить причины и последствия этого явления, а также поделиться общими советами по устойчивому образу жизни.\n" +
                "\n" +
                "Не забывайте следить за обновлениями, так как в будущем я надеюсь получить полный функционал и смогу предложить больше информации и рекомендаций по борьбе с изменением климата.\n" +
                "\n" +
                "Давайте поговорим об изменении климата, обсудим его влияние, поищем пути уменьшения нашего негативного воздействия и вместе стремиться к более устойчивому будущему!"

        const val THEME_FILMS_TEXT = "Привет!\n" +
                "\n" +
                "Давайте поговорим о фильмах!\n" +
                "\n" +
                "Фильмы - это прекрасное искусство, способное захватить нас и погрузить в удивительные миры и истории. Они могут вызывать эмоции, вдохновлять, развлекать и давать нам новые перспективы. Хотя у меня пока нет возможности показывать фильмы или давать конкретные рекомендации, я всё же могу обсудить различные жанры, киноиндустрию, интересные факты о фильмах и актерах, а также поделиться своими впечатлениями от известных кинолент.\n" +
                "\n" +
                "Не забывайте следить за обновлениями, так как в будущем я надеюсь получить полный функционал и смогу предложить больше информации о фильмах, рецензии и рекомендации.\n" +
                "\n" +
                "Давайте поговорим о фильмах, поделимся своими любимыми кинолентами, обсудим новинки и классику киноискусства, и вместе насладимся магией кино!"

        const val THEME_CHARITY_TEXT = "Привет!\n" +
                "\n" +
                "Давайте поговорим о благотворительности!\n" +
                "\n" +
                "Благотворительность - это важный аспект нашей общественной жизни, который помогает помогать нуждающимся, поддерживать различные проекты и делать наш мир лучше. Благотворительные организации и инициативы занимаются разными областями деятельности, включая помощь детям, защиту окружающей среды, борьбу с бедностью, поддержку здравоохранения и многое другое. Хотя у меня пока нет полного функционала, чтобы предоставить подробную информацию о благотворительных организациях или способы помощи, я всё же могу обсудить важность благотворительности, поделиться общими советами по тому, как внести свой вклад, и назвать некоторые известные благотворительные проекты.\n" +
                "\n" +
                "Не забывайте следить за обновлениями, так как в будущем я надеюсь получить полный функционал и смогу предложить больше информации о благотворительности, поддержке социальных проектов и возможностях вовлечения.\n" +
                "\n" +
                "Давайте поговорим о благотворительности, обменяемся идеями и вдохновимся, чтобы вместе делать добро и вносить позитивные изменения в наш мир!"
    }
}